# Напишіть програму, яка обчислить номінальну заробітну плату користувача відповідно до кількості робочих годин і ставки на годину.
# Сплачуйте стандартну ставку за 40 робочих годин, так 1.5-кратну ставку на годину за години які він  відпрацював понад 40 годин.
# Використайте цю логіку обчислення для створення функції computepay(), яка має отримувати значення.
# Для тестування використовуйте 45 годин та ставку 10.50 за годину (оплата має бути 498.75).
# Ви маєте застосувати input для читання рядка і float() для перетворення рядка на число.
# Не зважайте на можливі помилки при введенні даних - уважаймо, що користувач правильно вводить дані.
# Не називайте змінну sum і не використовуйте функцію sum().



def computepay(hours, rate):
    result = 0
    if hours > 40:
        delta_hours = hours - 40
        result = (delta_hours * rate * 1.5) + (40 * rate)
    elif hours <= 40:
        result = hours * rate
    return result


hours = float(input("Enter Hours:"))
rate = float(input("Enter rate: "))
print(computepay(hours, rate))